{
  "name": "Tom D'Roza",
  "info": {
    "label": "Scrum Master / Team Lead at BJSS",
    "image": "https://gravatar.com/avatar/9446f5a21bc9fd7d366dc5517d2df4e6?s=250",
    "brief": "Tom is a highly motivated individual with excellent technical and communication skills. An advocate of Agile development methodologies, Tom is an experienced professional software developer and technical team lead. His career spans twenty years in fields that include Healthcare, Commoditites Trading, Enterprise Web, Mobile and Location Based Services."
  },
  "contact": {
    "website": "http://happycampervanning.com/"    
  },
  "meta": {
    "format": "FRESH@^1.0.0-beta",
    "modified": "2019-03-02T117:15:24.985Z"
  },
  "location": {
    "city": "Leeds/Bradford",
    "region": "West Yorkshire",
    "country": "United Kingdom"
  },
  "employment": {
    "summary": "Scrum Master at BJSS",
    "history": [
      {
        "position": "Scrum Master",
        "employer": "BJSS. Client: National Healthcare Provider",
        "summary": "Initially involved in analysis of an existing proprietary legacy application and bid preparation prior to succesfully winning the contract for a functionally equivalent replacement built on Open Source technologies. Tom's role involved 2-week on-site pre-elaboration phase focussing on examination of the existing codebase, code metrics, functional analysis Close working with Business Analysts and Subject Matter Experts leading to requirements gathering, discussions with the client's own Technical Architects, and investigation into candidate technologies for the bid. Following the pre-elaboration, Tom was then heavily involved in the proposal document that formed the basis of the succesful bid. He produced key sections of the document including comparison of web technologies and frameworks, database systems and CMS. Following a successful bid, Tom was fundamental to the Sprint Zero and Elaboration activities, setting up Git repositores, CI build servers, project structure and the reference architecture. This role required close teamwork with the Principal and Technical Architects to refine and agree the project's code structure and key design patterns around separation of tiers, REST APIs, database transactions and audit, module structure and coding standards.<p/>Currently Tom's role is as a technical lead and Scrum Master for an end-to-end development team of 10 to 12 people including a Business Analyst, Developers, Functional Testers and Automation Engineers. Tom's day-to-day activities include running of daily stand-ups, sprint planning, code reviews and retrospectives. He is responsible for sprint delivery and code quality as well as longer term objectives including knowledge sharing, documentation and upskilling of the team.",
        "current": true,
        "start": "2013-05-01",
        "location": "Leeds, West Yorkshire, UK",
        "url": "https://bjss.com/",
        "keywords": [
          "Agile",
          "Scrum",
          "Java",
          "Web",
          "Javascript",
          "AngularJS",
          "Git",
          "Quality",
          "REST",
          "API"
        ],
        "highlights": [
          "Analysis of legacy application",
          "Successful bid for new work",
          "Elaboration",
          "Team lead"
        ]
      },
      {
        "position": "Software Engineer",
        "employer": "BJSS. Client: International Commodities Trader",
        "summary": "Tom joined this project as a software engineer during its final phase to assist with completing the functional development and bug fixing in preparation for a parallel run prior to go-live, where the new application was trialed alongside the existing legacy application. The role required Tom to familiarise himself with the existing codebase and a large number of integration points with other work-streams and APIs in order to contribute productively to project. Key challenges included working as part of a large team spread over multiple locations and a number of different suppliers, often poorly defined or with changing requirements and complex domain knowledge around commodities trading and invoicing. ",
        "start": "2012-12-01",
        "end": "2013-05-01",
        "current": false,
        "location": "Leeds, West Yorkshire, United Kingdom",
        "url": "https://bjss.com/",
        "keywords": [
          "Scala",
          "Ruby",
          "C#"
        ],
        "highlights": [
          "Scala",
          "Developer"
        ]
      },
      {
        "position": "Software Engineer",
        "employer": "BJSS. Client: International Commodities Trader",
        "summary": "Responsible for the delivery of software components that receive events from other work streams to trigger the generation of cost items for Interest, Warehouse Rent, Transportation and Valuations. Costs are displayed to traders as a key tool to manage profit/loss. The application is a large scale distributed system using a broad mix of technologies including Scala, Ruby and C#. Tom’s main development role focused on Scala and he adapted quickly to a new programming language, demonstrating an ability to 'hit the ground running' and make a valuable contribution to functionality, unit and component testing.",
        "start": "2012-12-01",
        "end": "2013-05-01",
        "current": false,
        "location": "Leeds, West Yorkshire, United Kingdom",
        "url": "https://bjss.com/",
        "keywords": [
          "Scala",
          "Java",
          "Ruby"
        ],
        "highlights": [
          "Scala",
          "Java"
        ]
      },
      {
        "position": "Lead Software Engineer",
        "employer": "BT.com",
        "summary": "Lead developer on BT.com eCommerce platform; Projects include the development of the Google powered search results page (using XML/XSLT and Zeus traffic manager) for BT Internet users, which receives over 1 million hits per day and generates significant advertising revenue; Strong emphasis on performance and stability. Key member of team working on complete redesign of the retail consumer MyAccount homepage and successfully delivered a new online order tracking application resulting in 30% improvement in successfully tracked orders, and 1000 fewer helpdesk calls per week.\nLeading a small on-shore development team as an exemplar of how a test driven, agile development methodology, coupled with experienced, skilled developers, can result in better quality deliveries.",
        "start": "2009-04-01",
        "end": "2011-07-01",
        "url": "https://bt.com/",
        "current": false,
        "location": "Martlesham, Ipswich, Suffolk, UK",
        "keywords": [
          "XML",
          "XSLT",
          "Web",
          "Google"
        ],
        "highlights": [
          "XML",
          "XSLT"
        ]
      },
      {
        "position": "Lead Software Engineer",
        "employer": "BT",
        "summary": "Lead developer for the BT.com Beta platform. Role involved design assurance, review and sign-off of designs and test plans, and technical leadership of development team. Striving to introduce an element of innovation into BT's online presence by launching new self-service applications in “beta” format. Applications that graduate from Beta status are migrated to the mainstream BT.com platform. Unsuccessful applications are quickly identified and reworked or “fail fast” thereby minimising wasted development expense. Tom led a small team of 3 developers to create a gadget framework based around the open source Apache Shindig project for use as a personalised portal for the top 15 BT Wholesale customers.",
        "start": "2008-01-01",
        "end": "2009-04-01",
        "location": "Martlesham, Ipswich, Suffolk, UK",
        "url": "https://bt.com/",
        "current": false,
        "keywords": [
          "Javascript",
          "JQuery",
          "Java"
        ],
        "highlights": [
          "JQuery",
          "Java"
        ]
      },
      {
        "position": "J2EE Software Engineer",
        "employer": "BT",
        "summary": "J2EE developer on BT.com Beta. Focusing on innovative new applications heavily influenced by emerging Web2.0 technologies and following Agile Delivery work practices. Responsibilities included rapid turnaround of prototypes, proof-of-concepts, high-level design, implementation, and close collaboration with Business Improvement managers to identify and capture the requirements that solve business problems. Other responsibilities include facilitator of Agile Scrum sessions, running daily stand-up meetings and weekly checkpoints. Particular focus on developing new applications around: Google Maps; Ajax, Widgets/Gadgets (iGoogle); 3rd party data APIs (ReST, XML, JSON) and Javascript frameworks (Jquery, prototype, scriptaculous etc).",
        "start": "2005-12-01",
        "end": "2007-12-01",
        "current": false,
        "url": "https://bt.com/",
        "location": "Martlesham, Ipswich, Suffolk, UK",
        "keywords": [
          "Google",
          "Maps",
          "Javascript",
          "JQuery",
          "Agile"
        ],
        "highlights": [
          "JQuery",
          "Google Maps",
          "Agile"
        ]
      },
      {
        "position": "J2EE Software Engineer",
        "employer": "BT",
        "summary": "Rewriting key consumer web applications for new WebLogic Portal platform. Release 1: worked on Access Control, focussing on Login & Registration. Responsible for implementation of key components of the website security. Release 2: Worked on Products & Services webapp, responsible for implementation of key back-end EJB components.",
        "start": "2003-04-01",
        "end": "2005-12-01",
        "current": false,
        "url": "https://bt.com/",
        "location": "Martlesham, Ipswich, Suffolk, UK",
        "keywords": [
          "Location based services",
          "Satellite",
          "SMS",
          "mobile"
        ],
        "highlights": [
          "Weblogic",
          "Access control"
        ]
      },
      {
        "position": "Developer",
        "employer": "BT",
        "summary": "Joined BT, working on Webtrack, a web based fleet management and tracking application using GPS positioning and Inmarsat satellite/SMS messaging. Writing comms applications and developing for mobile devices (Windows CE). Responsible for creating a mobile application that was successfully trialled within BTPayphones. Developed mobile consumer applications based around SMS, personalisation and location, and resulting in an application prototype that was delivered into the BT Brightstar incuband Rocking Frog for commercial exploitation outside of BT. Performed customer contact role to Internal Ventures customer. Also supported external proposition development.",
        "start": "1999-07-01",
        "end": "2003-04-03",
        "url": "https://bt.com/",
        "keywords": [],
        "highlights": [
          "SMS",
          "mobile"
        ]
      }
    ]
  },
  "education": {
    "level": "",
    "history": [
      {
        "institution": "University of Nottingham",
        "start": "1996-09-01",
        "end": "1999-06-01",
        "grade": "2:1",
        "summary": "",
        "studyType": "BSc (Hons)",
        "area": "Computer Science, Artificial Intelligence and Psychology"
      },
      {
        "institution": "Sheffield College, Norton Centre",
        "start": "1994-09-01",
        "end": "1996-06-01",
        "grade": "",
        "summary": "",
        "studyType": "A-Level",
        "area": "Maths, English, Computing, General Studies; AS-Level Further Maths"
      },
      {
        "institution": "Suffolk College",
        "start": "2003-09-01",
        "end": "2004-06-01",
        "grade": "A",
        "summary": "",
        "studyType": "GCSE",
        "area": "Italian"
      },
      {
        "institution": "Abbeydale Grange School, Sheffield",
        "start": "1994-09-01",
        "end": "1990-06-01",
        "grade": "8As, 2A*",
        "summary": "",
        "studyType": "GCSE",
        "area": "Maths, English, French, Science (x2), Business Studies, IT, Humanities"
      }
    ]
  },
  "skills": {
    "sets": [
      {
        "name": "Scrum Master",
        "level": "advanced",
        "skills": [
          "estimation",
          "sprint planning",
          "stand-ups",
          "retrospectives",
          "kanban",
          "scrum"
        ]
      },
      {
        "name": "Back-end development",
        "level": "advanced",
        "skills": [
          "java",
          "junit",
          "test-ng",
          "spring",
          "hibernate"
        ]
      },
      {
        "name": "Front-end development",
        "level": "intermediate",
        "skills": [
          "html",
          "css",
          "sass",
          "php",
          "javascript",
          "angular JS"
        ]
      },
      {
        "name": "Databases",
        "level": "intermediate",
        "skills": [
          "postgresql",
          "mysql"
        ]
      }
    ]
  },
  "social": [
    {
      "label": "Twitter",
      "network": "Twitter",
      "url": "https://twitter.com/tdroza",
      "user": "tdroza"
    },
    {
      "label": "Github",
      "network": "Github",
      "url": "https://github.com/tdroza",
      "user": "tdroza"
    },
    {
      "label": "Flickr",
      "network": "Flickr",
      "url": "https://flickr.com/photos/tdroza",
      "user": "tdroza"
    },
    {
      "label": "YouTube",
      "network": "YouTube",
      "url": "https://youtube.com/user/tdroza",
      "user": "tdroza"
    }
  ],
  "writing" : [
    {
        "title" : "An Overview of Location-Based Services",
        "category": "journal",
        "publisher": {
            "name": "BT Technology Journal"
        },
        "date": "2003-01-01",
        "url": "https://link.springer.com/article/10.1023%2FA%3A1022491825047",
        "summary": "This paper provides an overview of terms, technologies and standards used within the location-based services field in the determination and presentation of the location of an entity. A description is provided of data formats and protocols for communicating, storing and manipulating location information and some insight is given into how location information could be used in a range of applications."

    }
  ],
  "interests": [
    {
      "name": "Photography",
      "summary": "I have an interest in photography and have run a photo competition at work for the last 6 years.",
      "keywords": [
        "photo, camera, photography, pictures, video, videography"
      ]
    },
    {
      "name": "Home Automation & Smart Home",
      "summary": "My interest in Home Automation started over 10 years ago with X10 devices, but more recently has focused on smart lighting, voice controlled home assistants, heating, network cameras whole house audio and making this all play nicely together in a user-friendly way",
      "keywords": [
        "ha, home automation, smarhome, smart, home"
      ]
    },
    {
      "name": "Music",
      "summary": "There's always music playing at home or in the car or on my commute. Music can either help me to relax, or help me to focus. It can block out the outside world or be used to remind me of an event or time from my past. I don't play any instruments, but recently bought a keyboard so one day might be able to play chopsticks!",
      "keywords": [
        "music, audio"
      ]
    },
    {
      "name": "Formula 1",
      "summary": "I have been an avid follower of F1 since the early nineties, mostly as a television spectator but in the last few years have been to a pre-season test (Circuit de Catalunya, Barcelona) and a race (Spa-Francorchamps, Belgium)",
      "keywords": [
        "f1, formula 1, racing, motorsport, gp, grand prix"
      ]
    },
    {
      "name": "Camping",
      "summary": "I previously owned an imported Japanese Mazda Bongo campervan and enjoyed exploring the UK in it, but outgrew its size and it's (un)reliability meant I never dared travel beyond these shores. I'm now continuing my camping adventures with a Camplet trailer-tent and have made two trips to Europe so far (France and Belgium). I also run the HappyCampervanning campsite review website as a writer, designer and administrator.",
      "keywords": [
        "camping, campsite, campervan, mazda, bongo, camplet"
      ]
    }
  ]
}
