{
  "name": "Tom D'Roza",
  "info": {
    "label": "Scrum Master / Team Lead at BJSS",
    "image": "https%3A%2F%2Fgravatar.com%2Favatar%2F9446f5a21bc9fd7d366dc5517d2df4e6%3Fs%3D200%22",
    "brief": "Tom is a highly motivated individual with excellent technical and communication skills. An experienced professional software developer and technical team lead, with a career spanning twenty years in fields ranging from Enterprise Web, Mobile, Location Based Services, and currently working on a national healthcare system."
  },
  "contact": {
    "website": "http://twitter.com/tdroza"
  },
  "meta": {
    "format": "FRESH@^1.0.0-beta",
    "modified": "2019-02-22T22:01:21.152Z"
  },
  "location": {
    "city": "Leeds",
    "region": "West Yorkshire",
    "country": "United Kingdom"
  },
  "employment": {
    "summary": "Scrum Master at BJSS",
    "history": [
      {
        "position": "Scrum Master",
        "employer": "BJSS, Leeds",
        "summary": "Initially involved in analysis of the existing legacy application and bid preparation prior to winning the contract. Role involved 2-week on-site pre-elaboration phase focussing on examination of existing proprietary codebase for the legacy application, code metrics, functional analysis, detailed discussion with Business Analysts leading to requirements gathering, discussions with the client's own Technical Architects, and investigation into candidate technologies for the bid. Following the pre-elaboration, Tom was then heavily involved in the proposal document that formed the basis of the bid. Producing key sections of the document including comparison of web technologies and frameworks, database systems, CMS. Following a successful bid, Tom was heavily involved in the Sprint Zero and Elaboration activities, setting up Git repositores, build servers, project structure and the reference architecture. This role required close teamwork with the Technical Architects to refine and agree the project's code structure and key design patterns around separation of tiers, REST APIs, database transactions and audit, module structure and coding standards. ",
        "start": "2013-05-01",
        "location": "Leeds, West Yorkshire, United Kingdom",
        "url": "https://bjss.com/",
        "keywords": [
          "Agile",
          "Scrum",
          "Java",
          "Web",
          "Javascript",
          "Git",
          "Quality"
        ],
        "highlights": [
          "Analysis of legacy application",
          "Successful bid for new work",
          "Elaboration",
          "Team lead"
        ]
      }
    ]
  },
  "education": {
    "level": "GCSE",
    "history": [
      {
        "institution": "Abbeydale Grange Secondary School, Sheffield",
        "start": "1994-09-01",
        "end": "1990-06-01",
        "grade": "",
        "highlights": [
          "",
          ""
        ],
        "keywords": [
          "English",
          "Maths",
          "Science"
        ],
        "summary": "8As, 2A*",
        "studyType": "GCSE"
      }
    ]
  },
  "skills": {
    "sets": [
      {
        "name": "Stuff",
        "level": "intermediate",
        "skills": [
          ""
        ]
      }
    ]
  },
  "interests": [
    {
      "name": "Photography",
      "summary": "I have an interest in photography and have run a photo competition at work for the last 6 years.",
      "keywords": [
          "photo, camera, photography, pictures, video, videography"
      ]
    }
  ]
}
